{
  "name": "Kalashtar",
  "variants": [
    {
      "version_name": "Eberron - Rising from the Last War",
      "source": "Eberron - Rising from the Last War",
      "source_url": "http://dnd5e.wikidot.com/kalashtar",
      "ability_score_increase": [
        {
          "ability": "Wisdom",
          "increase": 2
        },
        {
          "ability": "Charisma",
          "increase": 1
        }
      ],
      "size": "Medium",
      "speed": {
        "base": 30
      },
      "creature_type": "Humanoid",
      "traits": [
        {
          "name": "Dual Mind",
          "description": "You have advantage on all Wisdom saving throws."
        },
        {
          "name": "Mental Discipline",
          "description": "You have resistance to psychic damage."
        },
        {
          "name": "Mind Link",
          "description": "You can speak telepathically to any creature you can see, provided the creature is within a number of feet of you equal to 10 times your level. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.\nWhen you're using this trait to speak telepathically to a creature, you can use your action to give that creature the ability to speak telepathically with you for 1 hour or until you end this effect as an action. To use this ability, the creature must be able to see you and must be within this trait's range. You can give this ability to only one creature at a time; giving it to a creature takes it away from another creature who has it."
        },
        {
          "name": "Severed from Dreams",
          "description": "Kalashtar sleep, but they don’t connect to the plane of dreams as other creatures do. Instead, their minds draw from the memories of their otherworldly spirit while they sleep. As such, you are immune to magical spells and effects that require you to dream, like the Dream spell, but not to spells and effects that put you to sleep, like the Sleep spell."
        }
      ],
      "languages": {
        "known": [
          "Common",
          "Quori"
        ],
        "choose": 1,
        "options_description": "one other language of your choice."
      }
    }
  ]
}
