{
  "name": "Lizardfolk",
  "variants": [
    {
      "version_name": "Mordenkainen's Multiverse",
      "source": "Mordenkainen Presents: Monsters of the Multiverse",
      "source_url": "http://dnd5e.wikidot.com/lizardfolk",
      "ability_score_increase": [
        {
          "type": "flexible",
          "options": [
            {
              "choose": 1,
              "increase": 2
            },
            {
              "choose": 1,
              "increase": 1
            }
          ],
          "description": "Increase one score by 2 and increase a different score by 1."
        },
        {
          "type": "flexible",
          "options": [
            {
              "choose": 3,
              "increase": 1
            }
          ],
          "description": "Or increase three different scores by 1."
        }
      ],
      "size": "Medium",
      "speed": {
        "base": 30,
        "swim": 30
      },
      "creature_type": "Humanoid",
      "traits": [
        {
          "name": "Bite",
          "description": "You have a fanged maw that you can use to make unarmed strikes. When you hit with it, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
        },
        {
          "name": "Hold Breath",
          "description": "You can hold your breath for up to 15 minutes at a time."
        },
        {
          "name": "Hungry Jaws",
          "description": "You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        },
        {
          "name": "Natural Armor",
          "description": "You have tough, scaly skin. When you aren’t wearing armor, your base AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield’s benefits apply as normal while you use your natural armor."
        },
        {
          "name": "Nature's Intuition",
          "description": "Thanks to your mystical connection to nature, you gain proficiency with two of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
        }
      ],
      "languages": {
        "known": [
          "Common"
        ],
        "choose": 1,
        "options_description": "one other language that you and your DM agree is appropriate for the character."
      }
    },
    {
      "version_name": "Volo's Guide",
      "source": "Volo's Guide to Monsters",
      "source_url": "http://dnd5e.wikidot.com/lizardfolk",
      "ability_score_increase": [
        {
          "ability": "Constitution",
          "increase": 2
        },
        {
          "ability": "Wisdom",
          "increase": 1
        }
      ],
      "size": "Medium",
      "speed": {
        "base": 30,
        "swim": 30
      },
      "creature_type": "Humanoid",
      "traits": [
        {
          "name": "Bite",
          "description": "Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
        },
        {
          "name": "Cunning Artisan",
          "description": "As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size Small or larger to create one of the following items: a shield, a club, a javelin, or 1d4 darts or blowgun needles. To use this trait, you need a blade, such as a dagger, or appropriate artisan's tools, such as leatherworker's tools."
        },
        {
          "name": "Hold Breath",
          "description": "You can hold your breath for up to 15 minutes at a time."
        },
        {
          "name": "Hunter's Lore",
          "description": "You gain proficiency with two of the following skills of your choice: Animal Handling, Nature, Perception, Stealth, and Survival."
        },
        {
          "name": "Natural Armor",
          "description": "You have tough, scaly skin. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
        },
        {
          "name": "Hungry Jaws",
          "description": "In battle, you can throw yourself into a vicious feeding frenzy. As a bonus action, you can make a special attack with your bite. If the attack hits, it deals its normal damage, and you gain temporary hit points (minimum of 1) equal to your Constitution modifier, and you can't use this trait again until you finish a short or long rest."
        }
      ],
      "languages": {
        "known": [
          "Common",
          "Draconic"
        ]
      }
    }
  ]
}
